# Using SQl in Python (pandas and ipython-sql)

In [ ]:
!pip install pymysql psycopg2-binary

In [1]:
# import Libraries
import pymysql
import psycopg2
import sqlite3

from sqlalchemy import create_engine
import pandas as pd
from dotenv import load_dotenv 
import os

 As a best pratice , we would define out database credentals in as environment variables rather than hard coding in our notebook or script

In [2]:
load_dotenv()

True

In [3]:
# load environment variables
username = os.getenv('MYSQL_USER')
password = os.getenv('MYSQL_PASSWORD')
host = os.getenv('MYSQL_HOST')
port = os.getenv('MYSQL_PORT', 3306)
database = os.getenv('MYSQL_DB')

## SQL with Pandas


We can read SQL query or database table into a DataFrame:

**Syntax:** 

**pandas.read_sql**(sql, con, index_col=None, coerce_float=True, params=None, parse_dates=None, columns=None, chunksize=None, dtype_backend=<no_default>, dtype=None)

The main parameter is con

con:  ADBC Connection, SQLAlchemy connectable, str, or sqlite3 connection
ADBC provides high performance I/O with native type support, where available. Using SQLAlchemy makes it possible to use any DB supported by that library. If a DBAPI2 object, only sqlite3 is supported. The user is responsible for engine disposal and connection closure for the ADBC connection and SQLAlchemy connectable; str connections are closed automatically.

There are three easy options to create a connection to the database :
1. Using the python driver API (DBAPI2) directly 
2. Sqlalchemy connection
3. Python string URI - SQLite only

**DBAPI2**

In [4]:
# Using MYSQL database 

con = pymysql.connect(
    host=host,
    user=username,
    password=password,
    database=database,
    port=int(port)
)

query = "SELECT * FROM classic_employees"

# Read data from database
df = pd.read_sql(sql=query, con=con)

/var/folders/tw/r8gpm72d39j_40bs5cm02m640000gn/T/ipykernel_18891/3800730533.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql=query, con=con)

In [5]:
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,employeeName
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,None,President,DianeMurphy
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales,MaryPatterson
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing,JeffFirrelli
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC),WilliamPatterson
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA),GerardBondur

In [6]:
# Sqlite connection

con = sqlite3.connect('database.db')  # creates file if not exists


df.to_sql('classic_employees', con=con, if_exists='replace', index=False)

con.close()

In [ ]:
""" The string form of the URL is
``dialect[+driver]://user:password@host/dbname[?key=value..]``, where
``dialect`` is a database name such as ``mysql``, ``oracle``,
``postgresql``, etc., and ``driver`` the name of a DBAPI, such as
``psycopg2``, ``pyodbc``, ``cx_oracle``, etc.  Alternatively,
the URL can be an instance of :class:`~sqlalchemy.engine.url.URL`."""

In [7]:
# Create a SQlALCHEMY engine
connection_string = f'mysql+pymysql://{username}:{password}@{host}/{database}'

engine = create_engine(connection_string)

In [8]:
# Write data back to database to demonstrate write operation with engine 
df.to_sql('employees_backup', con=engine, if_exists='replace', index=False)

# Close connection
con.close()

In [9]:
# Create a query and read back data with pandas

query = """
SELECT * 
    FROM employees_backup"""

df = pd.read_sql(query, engine)

In [10]:
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,employeeName
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,None,President,DianeMurphy
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales,MaryPatterson
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing,JeffFirrelli
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC),WilliamPatterson
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA),GerardBondur

In [11]:
# Using SQLAlchemy engine connection
connection = engine.connect()

query = """
SELECT * FROM classic_orders LIMIT 5"""

orders = pd.read_sql(sql=query, con=connection)

In [15]:
orders

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,None,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,None,141

In [13]:
# SQLite URI, no SQLAlchemy needed

df = pd.read_sql(
    "SELECT * FROM classic_employees WHERE reportsTo = 1002",
    "sqlite:///database.db"      
)

In [14]:
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,employeeName
0,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales,MaryPatterson
1,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing,JeffFirrelli

In [ ]:
# !pip install ipython-sql

## Run SQL code in notebook using SQL Magic
There is need to first install `ipython-sql` to use the SQL magic. 

We use the `%load_ext` magic command to load the SQL Magic extension and then use `%sql` to connect to the database.

Use `%%sql` for a multiple line SQL code. Nothing else can be in the cell (e.g. comments)

The %sql magic uses the SQLAlchemy string to connect to the database

In [16]:

# loads sql magic
%load_ext sql 

# connects sql magic command to the db using the SQLAlchemy string
%sql $connection_string

In [24]:
# Verify styles available
import prettytable
print(prettytable.__dict__.keys())

dict_keys(['__name__', '__doc__', '__package__', '__loader__', '__spec__', '__path__', '__file__', '__cached__', '__builtins__', 'annotations', 'Any', '_version', '__version__', 'prettytable', '_DEPRECATED_ALL', '_DEPRECATED_DEFAULT', '_DEPRECATED_DOUBLE_BORDER', '_DEPRECATED_FRAME', '_DEPRECATED_HEADER', '_DEPRECATED_MARKDOWN', '_DEPRECATED_MSWORD_FRIENDLY', '_DEPRECATED_NONE', '_DEPRECATED_ORGMODE', '_DEPRECATED_PLAIN_COLUMNS', '_DEPRECATED_RANDOM', '_DEPRECATED_SINGLE_BORDER', 'HRuleStyle', 'PrettyTable', 'RowType', 'TableHandler', 'TableStyle', 'VRuleStyle', '_warn_deprecation', 'from_csv', 'from_db_cursor', 'from_html', 'from_html_one', 'from_json', 'from_mediawiki', '__all__', '__getattr__'])

In [25]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [18]:
# Explore columns in tables
%sql SELECT * FROM classic_employees LIMIT 5

 * mysql+pymysql://root:***@localhost/Classic
5 rows affected.

[(1002, 'Murphy', 'Diane', 'x5800', 'dmurphy@classicmodelcars.com', 1, None, 'President', 'DianeMurphy'),
 (1056, 'Patterson', 'Mary', 'x4611', 'mpatterso@classicmodelcars.com', 1, '1002', 'VP Sales', 'MaryPatterson'),
 (1076, 'Firrelli', 'Jeff', 'x9273', 'jfirrelli@classicmodelcars.com', 1, '1002', 'VP Marketing', 'JeffFirrelli'),
 (1088, 'Patterson', 'William', 'x4871', 'wpatterson@classicmodelcars.com', 6, '1056', 'Sales Manager (APAC)', 'WilliamPatterson'),
 (1102, 'Bondur', 'Gerard', 'x5408', 'gbondur@classicmodelcars.com', 4, '1056', 'Sale Manager (EMEA)', 'GerardBondur')]

In [19]:
result = %sql SELECT * FROM classic_employees WHERE reportsTo = 1056

 * mysql+pymysql://root:***@localhost/Classic
4 rows affected.

In [20]:
result

[(1088, 'Patterson', 'William', 'x4871', 'wpatterson@classicmodelcars.com', 6, '1056', 'Sales Manager (APAC)', 'WilliamPatterson'),
 (1102, 'Bondur', 'Gerard', 'x5408', 'gbondur@classicmodelcars.com', 4, '1056', 'Sale Manager (EMEA)', 'GerardBondur'),
 (1143, 'Bow', 'Anthony', 'x5428', 'abow@classicmodelcars.com', 1, '1056', 'Sales Manager (NA)', 'AnthonyBow'),
 (1621, 'Nishi', 'Mami', 'x101', 'mnishi@classicmodelcars.com', 5, '1056', 'Sales Rep', 'MamiNishi')]

For multi line sql statements use `%%sql` as follows. This tells Jupyter that *everything* in this cell should be interpreted as sql. So, NO comments other statements are allowed:

In [21]:
%%sql
SELECT employeeNumber, lastname, firstname, jobTitle
    FROM classic_employees
        LIMIT 10

 * mysql+pymysql://root:***@localhost/Classic
10 rows affected.

[(1002, 'Murphy', 'Diane', 'President'),
 (1056, 'Patterson', 'Mary', 'VP Sales'),
 (1076, 'Firrelli', 'Jeff', 'VP Marketing'),
 (1088, 'Patterson', 'William', 'Sales Manager (APAC)'),
 (1102, 'Bondur', 'Gerard', 'Sale Manager (EMEA)'),
 (1143, 'Bow', 'Anthony', 'Sales Manager (NA)'),
 (1165, 'Jennings', 'Leslie', 'Sales Rep'),
 (1166, 'Thompson', 'Leslie', 'Sales Rep'),
 (1188, 'Firrelli', 'Julie', 'Sales Rep'),
 (1216, 'Patterson', 'Steve', 'Sales Rep')]

In [22]:
%%sql result <<
SELECT employeeNumber, lastname, firstname, jobTitle
    FROM classic_employees

 * mysql+pymysql://root:***@localhost/Classic
23 rows affected.
Returning data to local variable result

In [23]:
df = result.DataFrame()
df.head()

   employeeNumber   lastname firstname              jobTitle
0            1002     Murphy     Diane             President
1            1056  Patterson      Mary              VP Sales
2            1076   Firrelli      Jeff          VP Marketing
3            1088  Patterson   William  Sales Manager (APAC)
4            1102     Bondur    Gerard   Sale Manager (EMEA)

**All Done!**

Great job. You now have a good idea for how to use sql and pandas with sql. You can create your own databases from csv files and you can do extensive querying using sql. These are valuable skills that will take you a long ways in todays technological world.